---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyRevolveAxis
source: html/02eb57d8-a245-7c91-3a43-9922cc761ffb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyRevolveAxis Property

The axis cannot be copied.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyRevolveAxis { get; }
```